Tekla.Structures.CatalogInternal.ShapeHandler.GetShapesWithMatchingGeometryFingerprint(System.String)
Gets a list of guids of any shapes already in the catalog that have matching geometry fingerprints.
fingerprintToFind: A shape geometry fingerprint to search for.
Returns: A list of guids for any shapes already in the catalog that have matching geometry fingerprints.
Throws System.ArgumentException: Thrown if the value of the parameter is null or whitespace..

Tekla.Structures.CatalogInternal.ShapeHandler.GetShapeByGuid(System.String)
Get an existing ShapeItem with a specified guid from the shape catalog if it exists.
shapeGuid: The shape GUID
Returns: The ShapeItem if found; otherwise null.